Revit 2024 API
CeramicBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicBump" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum CeramicBumpType
Visual Basic
Public Enumeration CeramicBumpType
Visual C++
public enum class CeramicBumpType
Members
Member name | Description
None
Wavy
Custom
See Also
Autodesk.Revit.DB.Visual Namespace